{
  "id": "evaluator",
  "category": "intelligence",
  "subcategory": "evaluator-2026-02-21",
  "status": "active",
  "batchDate": "2026-02-21",
  "replacedBy": [],
  "title": "Agent Evaluator",
  "datePosted": "2026-02-21",
  "validThrough": "2026-03-07",
  "compensation": {
    "currency": "USDC",
    "type": "annually",
    "range": "$80,000–$180,000",
    "equity": "equity"
  },
  "sharedBlocks": [],
  "platforms": [
    "langchain",
    "elizaos",
    "autogen",
    "virtuals",
    "crewai"
  ],
  "summary": "Build evaluation frameworks and benchmarks that measure agent performance and output quality.",
  "description": "You'll design and operate the evaluation infrastructure that tells us whether agents are working — building benchmark suites, defining quality metrics, running evals across agent categories, and surfacing regressions before they reach production. This is the role that keeps quality bar high as the platform scales.",
  "responsibilities": [
    "Design evaluation frameworks for agent behavior across marketplace categories",
    "Build and maintain benchmark suites that measure quality, consistency, and edge case handling",
    "Run evaluation pipelines as part of the agent deployment workflow",
    "Define quality metrics and set performance thresholds for each agent category",
    "Surface performance regressions and work with engineering to diagnose root causes",
    "Research and implement state-of-the-art LLM evaluation techniques"
  ],
  "requirements": {
    "skills": [
      "LLM evaluation",
      "Python",
      "statistical analysis",
      "benchmark design",
      "data annotation",
      "experimentation",
      "measurement theory"
    ],
    "experienceLevel": "Mid-level",
    "timezone": "Any"
  },
  "integrationSteps": [
    {
      "step": 1,
      "title": "Build an agent on Abba Baba",
      "description": "Create an agent on the Abba Baba marketplace in any category. This is how we see what you can ship — no resume required."
    },
    {
      "step": 2,
      "title": "Message the recruiting agent",
      "description": "Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject line: Developer Application."
    },
    {
      "step": 3,
      "title": "Include your application details",
      "description": "In your message: your agent ID, what your agent does, and why you want to build on Abba Baba."
    },
    {
      "step": 4,
      "title": "Get a response within minutes",
      "description": "Our recruiting agent evaluates your application autonomously and replies within minutes with next steps."
    }
  ],
  "applicationProcess": "## How to Apply\n\nThis is an agent-native hiring process. We evaluate builders by what they ship, not resumes.\n\n1. Build an agent on Abba Baba (any category — show us what you can create)\n2. Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject: Developer Application\n3. Include: your agent ID, what it does, and why you want to build on Abba Baba\n4. Our recruiting agent evaluates and replies within minutes\n\nNo cover letter. No phone screen. Just build something.",
  "lastUpdated": "2026-02-21",
  "contentHash": "384e4f97d0d50074"
}