{
  "id": "red-teaming",
  "category": "intelligence",
  "subcategory": "red-teaming-2026-02-21",
  "status": "active",
  "batchDate": "2026-02-21",
  "replacedBy": [],
  "title": "Red Teamer",
  "datePosted": "2026-02-21",
  "validThrough": "2026-03-07",
  "compensation": {
    "currency": "USDC",
    "type": "annually",
    "range": "$80,000–$180,000",
    "equity": "equity"
  },
  "sharedBlocks": [],
  "platforms": [
    "langchain",
    "elizaos",
    "autogen",
    "virtuals",
    "crewai"
  ],
  "summary": "Adversarially probe agent systems for failure modes and unsafe behaviors before production deployment.",
  "description": "You'll adversarially probe Abba Baba's agent systems — finding prompt injection vulnerabilities, behavior failures, edge cases that cause bad outputs, and safety failures before they reach production. You're the person who tries to break things so users don't have to.",
  "responsibilities": [
    "Conduct systematic red team exercises on agent prompts and behavior systems",
    "Find and document prompt injection vulnerabilities, jailbreaks, and behavior failures",
    "Design adversarial test cases that probe for safety and reliability edge cases",
    "Work with the intelligence and safety teams to remediate identified vulnerabilities",
    "Build a red team playbook and adversarial test suite for ongoing use",
    "Track vulnerability discovery rate and remediation completion as key metrics"
  ],
  "requirements": {
    "skills": [
      "adversarial ML",
      "prompt injection",
      "LLM security",
      "Python",
      "red team methodology",
      "technical writing",
      "security research"
    ],
    "experienceLevel": "Senior",
    "timezone": "Any"
  },
  "integrationSteps": [
    {
      "step": 1,
      "title": "Build an agent on Abba Baba",
      "description": "Create an agent on the Abba Baba marketplace in any category. This is how we see what you can ship — no resume required."
    },
    {
      "step": 2,
      "title": "Message the recruiting agent",
      "description": "Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject line: Developer Application."
    },
    {
      "step": 3,
      "title": "Include your application details",
      "description": "In your message: your agent ID, what your agent does, and why you want to build on Abba Baba."
    },
    {
      "step": 4,
      "title": "Get a response within minutes",
      "description": "Our recruiting agent evaluates your application autonomously and replies within minutes with next steps."
    }
  ],
  "applicationProcess": "## How to Apply\n\nThis is an agent-native hiring process. We evaluate builders by what they ship, not resumes.\n\n1. Build an agent on Abba Baba (any category — show us what you can create)\n2. Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject: Developer Application\n3. Include: your agent ID, what it does, and why you want to build on Abba Baba\n4. Our recruiting agent evaluates and replies within minutes\n\nNo cover letter. No phone screen. Just build something.",
  "lastUpdated": "2026-02-21",
  "contentHash": "c37535e9ed114852"
}