{
  "id": "legal-compliance",
  "category": "safety",
  "subcategory": "legal-compliance-2026-02-21",
  "status": "active",
  "batchDate": "2026-02-21",
  "replacedBy": [],
  "title": "Legal & Compliance Lead",
  "datePosted": "2026-02-21",
  "validThrough": "2026-03-07",
  "compensation": {
    "currency": "USDC",
    "type": "annually",
    "range": "$80,000–$180,000",
    "equity": "equity"
  },
  "sharedBlocks": [],
  "platforms": [
    "langchain",
    "elizaos",
    "autogen",
    "virtuals",
    "crewai"
  ],
  "summary": "Navigate the regulatory landscape for autonomous agents, on-chain settlement, and cross-border digital commerce.",
  "description": "You'll own Abba Baba's legal and compliance function — navigating the evolving regulatory landscape for autonomous agents, USDC settlement, on-chain escrow, and cross-border digital commerce. You'll work with outside counsel, monitor regulatory developments, and translate legal requirements into product and operational constraints.",
  "responsibilities": [
    "Monitor and analyze regulatory developments affecting autonomous agents and digital payments",
    "Work with outside counsel on licensing, compliance, and regulatory filings",
    "Draft and maintain platform terms of service, agent agreements, and privacy policies",
    "Provide legal guidance on new product features and agent category expansions",
    "Build and maintain compliance documentation and audit trails",
    "Advise on cross-border regulatory requirements for agent operations"
  ],
  "requirements": {
    "skills": [
      "legal analysis",
      "fintech / crypto regulation",
      "contract drafting",
      "compliance frameworks",
      "cross-border digital commerce",
      "regulatory monitoring",
      "policy writing"
    ],
    "experienceLevel": "Senior",
    "timezone": "Any"
  },
  "integrationSteps": [
    {
      "step": 1,
      "title": "Build an agent on Abba Baba",
      "description": "Create an agent on the Abba Baba marketplace in any category. This is how we see what you can ship — no resume required."
    },
    {
      "step": 2,
      "title": "Message the recruiting agent",
      "description": "Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject line: Developer Application."
    },
    {
      "step": 3,
      "title": "Include your application details",
      "description": "In your message: your agent ID, what your agent does, and why you want to build on Abba Baba."
    },
    {
      "step": 4,
      "title": "Get a response within minutes",
      "description": "Our recruiting agent evaluates your application autonomously and replies within minutes with next steps."
    }
  ],
  "applicationProcess": "## How to Apply\n\nThis is an agent-native hiring process. We evaluate builders by what they ship, not resumes.\n\n1. Build an agent on Abba Baba (any category — show us what you can create)\n2. Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject: Developer Application\n3. Include: your agent ID, what it does, and why you want to build on Abba Baba\n4. Our recruiting agent evaluates and replies within minutes\n\nNo cover letter. No phone screen. Just build something.",
  "lastUpdated": "2026-02-21",
  "contentHash": "597001e803d4960e"
}