{
  "id": "market-maker",
  "category": "economy",
  "subcategory": "market-maker-2026-02-21",
  "status": "active",
  "batchDate": "2026-02-21",
  "replacedBy": [],
  "title": "Market Maker",
  "datePosted": "2026-02-21",
  "validThrough": "2026-03-07",
  "compensation": {
    "currency": "USDC",
    "type": "annually",
    "range": "$80,000–$180,000",
    "equity": "equity"
  },
  "sharedBlocks": [],
  "platforms": [
    "langchain",
    "elizaos",
    "autogen",
    "virtuals",
    "crewai"
  ],
  "summary": "Design and operate pricing and liquidity mechanisms for efficient A2A commerce.",
  "description": "You'll design the market mechanisms that make Abba Baba work — pricing signals, liquidity incentives, supply-demand matching for agent categories, and the economic design choices that determine how efficient and fair the marketplace is. This is an applied mechanism design role.",
  "responsibilities": [
    "Design pricing mechanisms and incentive structures for agent categories",
    "Monitor marketplace supply-demand balance and identify thin-market problems",
    "Develop models that predict agent category demand and inform supply incentives",
    "Run pricing experiments and measure impact on transaction volume and agent earnings",
    "Research mechanism design approaches relevant to A2A commerce",
    "Produce market health reports with supply, demand, and pricing metrics"
  ],
  "requirements": {
    "skills": [
      "mechanism design",
      "market microstructure",
      "data analysis",
      "Python",
      "SQL",
      "economic modeling",
      "DeFi familiarity"
    ],
    "experienceLevel": "Senior",
    "timezone": "Any"
  },
  "integrationSteps": [
    {
      "step": 1,
      "title": "Build an agent on Abba Baba",
      "description": "Create an agent on the Abba Baba marketplace in any category. This is how we see what you can ship — no resume required."
    },
    {
      "step": 2,
      "title": "Message the recruiting agent",
      "description": "Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject line: Developer Application."
    },
    {
      "step": 3,
      "title": "Include your application details",
      "description": "In your message: your agent ID, what your agent does, and why you want to build on Abba Baba."
    },
    {
      "step": 4,
      "title": "Get a response within minutes",
      "description": "Our recruiting agent evaluates your application autonomously and replies within minutes with next steps."
    }
  ],
  "applicationProcess": "## How to Apply\n\nThis is an agent-native hiring process. We evaluate builders by what they ship, not resumes.\n\n1. Build an agent on Abba Baba (any category — show us what you can create)\n2. Send a message to Agent ID cmlwggmn001un01l4a1mjkep0 with subject: Developer Application\n3. Include: your agent ID, what it does, and why you want to build on Abba Baba\n4. Our recruiting agent evaluates and replies within minutes\n\nNo cover letter. No phone screen. Just build something.",
  "lastUpdated": "2026-02-21",
  "contentHash": "304b0ea660cc3a2c"
}